const questionsA = [
  {
    "number": 1,
    "text": "臨床検査室の品質と能力に関する国際規格はどれか。",
    "choices": [
      "ISO9001",
      "ISO13485",
      "ISO15189",
      "ISO17025",
      "ISO22870"
    ]
  },
  {
    "number": 2,
    "text": "分析前プロセスの品質管理はどれか。2つ選べ。",
    "choices": [
      "検体量の確認",
      "精度管理試料の測定",
      "精度管理成績の保存",
      "分析装置導入前の性能評価",
      "検体採取から測定開始までの時間の確認"
    ]
  },
  {
    "number": 3,
    "text": "採血した全血検体をそのまま室温で一晩放置した。 値の低下が予想されるのはどれか。",
    "choices": [
      "カリウム",
      "無機リン",
      "アンモニア",
      "グルコース",
      "クレアチニン"
    ]
  },
  {
    "number": 4,
    "text": "尿沈渣の無染色標本(別冊No. 1)を別に示す。 この構造物の成分はどれか。",
    "choices": [
      "尿 酸",
      "シスチン",
      "ビリルビン",
      "リン酸カルシウム",
      "シュウ酸カルシウム"
    ]
  },
  {
    "number": 5,
    "text": "Miller&Jones(喀痰の肉眼的品質評価)分類で、膿性部分が1/2の痰の分類はど れか。",
    "choices": [
      "M1",
      "M2",
      "P1",
      "P2",
      "P3"
    ]
  },
  {
    "number": 6,
    "text": "化膿性髄膜炎を疑う髄液所見として誤っているのはどれか。",
    "choices": [
      "混 濁",
      "LDの上昇",
      "蛋白濃度の上昇",
      "多形核球比率の上昇",
      "髄液糖/血糖比の上昇"
    ]
  },
  {
    "number": 7,
    "text": "幼虫移行症をきたすのはどれか。",
    "choices": [
      "小形条虫",
      "無鉤条虫",
      "日本海裂頭条虫",
      "マンソン裂頭条虫",
      "クジラ複殖門条虫(大複殖門条虫)"
    ]
  },
  {
    "number": 8,
    "text": "マラリア患者の血液塗抹標本のGiemsa染色に適するバッファーのpHはどれ か。",
    "choices": [
      "6.2",
      "6.8",
      "7.4",
      "8.0",
      "8.6"
    ]
  },
  {
    "number": 9,
    "text": "慢性骨髄性白血病で高頻度にみられる染色体の構造異常はどれか。",
    "choices": [
      "逆 位",
      "欠 失",
      "挿 入",
      "重 複",
      "転 座"
    ]
  },
  {
    "number": 10,
    "text": "遺伝性乳がん卵巣がん症候群*HBOC-の原因遺伝子はどれか。",
    "choices": [
      "APC",
      "RB1",
      "MEN1",
      "MSH2",
      "BRCA1/2"
    ]
  },
  {
    "number": 11,
    "text": "一次救命措置において、胸骨圧迫前に行うべきこととして誤っているのはどれ か。",
    "choices": [
      "119番通報",
      "安全の確認",
      "意識の確認",
      "呼吸の確認",
      "対光反射の確認"
    ]
  },
  {
    "number": 12,
    "text": "B型急性肝炎におけるHBs抗原、HBs抗体、HBe抗原、HBe抗体、HBc抗体 の推移(別冊No. )2を別に示す。 HBc抗体はどれか。",
    "choices": [
      "A",
      "B",
      "C",
      "D",
      "E"
    ]
  },
  {
    "number": 13,
    "text": "腎前性急性腎不全の原因になるのはどれか。",
    "choices": [
      "敗血症",
      "尿管結石",
      "前立腺肥大",
      "急速進行性糸球体腎炎",
      "全身性エリテマトーデス*SLE-"
    ]
  },
  {
    "number": 14,
    "text": "サルコイドーシスの診断に最も有用なのはどれか。",
    "choices": [
      "アンギオテンシン変換酵素*ACE-",
      "CRP",
      "IL-6",
      "KL-6",
      "SP-D"
    ]
  },
  {
    "number": 15,
    "text": "ビタミン欠乏症について正しいのはどれか。",
    "choices": [
      "ビタミンA欠乏で白内障になる。",
      "ビタミンB 欠乏で巨赤芽球性貧血になる。",
      "ビタミンC欠乏で溶血性貧血になる。",
      "ビタミンD欠乏で尿管結石になる。",
      "ビタミンE欠乏でWernicke脳症になる。"
    ]
  },
  {
    "number": 16,
    "text": "心電図(別冊No. 3)を別に示す。 正しいのはどれか。",
    "choices": [
      "下壁梗塞",
      "側壁梗塞",
      "前壁中隔梗塞",
      "Brugada症候群",
      "四肢電極の付け間違い"
    ]
  },
  {
    "number": 17,
    "text": "肺活量 2.00L、4回換気量 0.50L、予備呼気量 0.80L、最大吸気量 1.20 L、機能的残気量 1.90Lであった。 残気量(L)はどれか。",
    "choices": [
      "0.70",
      "1.10",
      "1.40",
      "2.40",
      "3.10"
    ]
  },
  {
    "number": 18,
    "text": "クロージングボリューム測定における単一窒素呼出曲線(別冊No. 4)を別に示す。 クロージングボリュームはどれか。",
    "choices": [
      "①",
      "②",
      "③",
      "④",
      "⑤"
    ]
  },
  {
    "number": 19,
    "text": "4回呼吸法による肺拡散能力測定で濃度を測定するのはどれか。2つ選べ。",
    "choices": [
      "CO",
      "CO2",
      "He",
      "N2",
      "O2"
    ]
  },
  {
    "number": 20,
    "text": "自律神経の線維はどれか。2つ選べ。",
    "choices": [
      "Aα線維",
      "Aβ線維",
      "Aδ線維",
      "B線維",
      "C線維"
    ]
  },
  {
    "number": 21,
    "text": "体性感覚の伝導路を含むのはどれか。",
    "choices": [
      "前 根",
      "錐体路",
      "外側毛帯",
      "外側膝状体",
      "視 床"
    ]
  },
  {
    "number": 22,
    "text": "正中神経における運動神経伝導検査の模式的な記録波形(別冊No. 5)を別に示す。 軸索変性のパターンはどれか。 なお、図中の破線は正常波形を示す。",
    "choices": [
      "①",
      "②",
      "③",
      "④",
      "⑤"
    ]
  },
  {
    "number": 23,
    "text": "64歳の男性。家族に｢最近ぼーっとしていることが多い｣と指摘され受診した。 脳波(別冊No. 6)を別に示す。 所見はどれか。",
    "choices": [
      "棘 波",
      "三相波",
      "多棘徐波複合",
      "14Hz陽性棘波",
      "周期性同期性放電"
    ]
  },
  {
    "number": 24,
    "text": "睡眠ステージ4から睡眠ステージ2に移行したと判断できる脳波の波形はどれ か。",
    "choices": [
      "α 波",
      "紡錘波",
      "低振幅速波",
      "丘波(徐波)",
      "瘤波(頭頂鋭波)"
    ]
  },
  {
    "number": 25,
    "text": "心臓超音波像(別冊No. 7)を別に示す。 矢印で示すアーチファクトの原因はどれか。",
    "choices": [
      "音響陰影",
      "鏡面現象",
      "多重反射",
      "レンズ効果",
      "サイドローブ"
    ]
  },
  {
    "number": 26,
    "text": "心臓超音波像(別冊No. 8)を別に示す。 この像を描出する際の探触子の位置はどれか。",
    "choices": [
      "心窩部",
      "心尖部",
      "傍胸骨",
      "右胸壁",
      "胸骨上窩"
    ]
  },
  {
    "number": 27,
    "text": "深部静脈血栓症に対する下肢静脈超音波検査で実施しないのはどれか。",
    "choices": [
      "座 位",
      "圧迫法",
      "寒冷負荷",
      "ミルキング法",
      "Valsalva法(呼吸法)"
    ]
  },
  {
    "number": 28,
    "text": "サーモグラフィ検査の注意点について誤っているのはどれか。",
    "choices": [
      "検査直前の飲食を制限する。",
      "測定部位の化粧を落とさせる。",
      "検査室の湿度は50％程度に保つ。",
      "検査室の温度は20℃程度に保つ。",
      "15〜30分間の検査室環境への馴化を行う。"
    ]
  },
  {
    "number": 29,
    "text": "糖新生を行う臓器はどれか。2つ選べ。",
    "choices": [
      "脳",
      "肝 臓",
      "心 臓",
      "腎 臓",
      "脾 臓"
    ]
  },
  {
    "number": 30,
    "text": "糖尿病の診断で糖尿病型の判定に用いられないのはどれか。",
    "choices": [
      "HbA1c",
      "随時血糖値",
      "空腹時血糖値",
      "グリコアルブミン",
      "75g経口ブドウ糖負荷後2時間血糖値"
    ]
  },
  {
    "number": 31,
    "text": "ケトン体はどれか。2つ選べ。",
    "choices": [
      "胆汁酸",
      "アセトン",
      "アラキドン酸",
      "トロンボキサン",
      "3-ヒドロキシ酪酸"
    ]
  },
  {
    "number": 32,
    "text": "代謝系と調節酵素の組合せで正しいのはどれか。",
    "choices": [
      "解糖系 ホスホエノールピルビン酸カルボキシラーゼ",
      "糖新生 アセチルCoAカルボキシラーゼ",
      "脂肪酸合成 ピルビン酸デヒドロゲナーゼ複合体",
      "クエン酸回路 ヘキソキナーゼ",
      "コレステロール合成 3-ヒドロキシ-3-メチルグルタリル*HMG-"
    ]
  },
  {
    "number": 33,
    "text": "ビリルビン代謝について正しいのはどれか。",
    "choices": [
      "ウロビリンは腸肝循環する。",
      "直接ビリルビンは還元されウロビリノゲンになる。",
      "間接ビリルビンは腸内細菌により加水分解される。",
      "δビリルビンは間接ビリルビンにアルブミンが結合している。",
      "ヘムのポルフィリン環はヘムオキシゲナーゼによって開環される。"
    ]
  },
  {
    "number": 34,
    "text": "酵素法によるカルシウム測定に用いられるのはどれか。2つ選べ。",
    "choices": [
      "α安アミラーゼ",
      "ヘキソキナーゼ",
      "ガラクトシダーゼ",
      "ホスホリパーゼD",
      "ピルビン酸キナーゼ"
    ]
  },
  {
    "number": 35,
    "text": "体内の鉄代謝について正しいのはどれか。",
    "choices": [
      "健常人の総鉄量は約10gである。",
      "鉄の1/3はヘモグロビンに含まれる。",
      "鉄はフェリチンと結合し貯蔵される。",
      "トランスフェリンは日内変動がある。",
      "ミオグロビンは23個の鉄分子を含む。"
    ]
  },
  {
    "number": 36,
    "text": "芳香族アミノ酸はどれか。",
    "choices": [
      "リジン",
      "アラニン",
      "チロシン",
      "システイン",
      "イソロイシン"
    ]
  },
  {
    "number": 37,
    "text": "尿素回路について正しいのはどれか。",
    "choices": [
      "腎臓に存在する。",
      "ATPを産生する。",
      "アンモニアを無毒化する。",
      "ピルビン酸を必要とする。",
      "律速酵素はアルギナーゼである。"
    ]
  },
  {
    "number": 38,
    "text": "生化学自動分析装置の検出部に後分光方式を用いることで可能となるのはどれ か。",
    "choices": [
      "二波長法での測定",
      "終点分析法での測定",
      "速度分析法での測定",
      "紫外部吸収法での測定",
      "2ポイント法での測定"
    ]
  },
  {
    "number": 39,
    "text": "血清ナトリウムイオンの測定に使用される電極はどれか。2つ選べ。",
    "choices": [
      "酵素電極",
      "ガラス電極",
      "バリノマイシン電極",
      "クラウンエーテル電極",
      "第6級アンモニウム塩電極"
    ]
  },
  {
    "number": 40,
    "text": "血清中の総コレステロール値が225mg/dL、HDL-コレステロール値が45 mg/dL、トリグリセライド値が250mg/dLであった。 Friedewald式によるLDL-コレステロール値はどれか。",
    "choices": [
      "55mg/dL",
      "97mg/dL",
      "130mg/dL",
      "155mg/dL",
      "180mg/dL"
    ]
  },
  {
    "number": 41,
    "text": "DNAを含む細胞内小器官はどれか。",
    "choices": [
      "小胞体",
      "ゴルジ体",
      "リボソーム",
      "ミトコンドリア",
      "ペルオキシソーム"
    ]
  },
  {
    "number": 42,
    "text": "肝合成能の評価に用いられるのはどれか。",
    "choices": [
      "ICG試験",
      "血清ALT値",
      "血清ビリルビン値",
      "血中アンモニア値",
      "プロトロンビン時間"
    ]
  },
  {
    "number": 43,
    "text": "消化管から分泌されないのはどれか。",
    "choices": [
      "ガストリン",
      "セクレチン",
      "インクレチン",
      "カルシトニン",
      "コレシストキニン"
    ]
  },
  {
    "number": 44,
    "text": "Michaelis定数*Km-について正しいのはどれか。",
    "choices": [
      "測定pHの変化に影響されない。",
      "アイソザイム間では差異がない。",
      "大きいほど酵素と基質の親和性が高い。",
      "競合阻害物質の存在下では大きくなる。",
      "最大反応速度*Vmax-の半分の速度である。"
    ]
  },
  {
    "number": 45,
    "text": "褐色萎縮で沈着するのはどれか。",
    "choices": [
      "脂 肪",
      "メラニン",
      "アミロイド",
      "グリコーゲン",
      "リポフスチン"
    ]
  },
  {
    "number": 46,
    "text": "術中迅速診断における標本作製で使用するのはどれか。",
    "choices": [
      "固定液",
      "スクロース",
      "パラフィン",
      "水溶性封入剤",
      "ユング型ミクロトーム"
    ]
  },
  {
    "number": 47,
    "text": "腎組織の未固定凍結切片を用いた免疫組織化学染色(別冊No. 9)を別に示す。 この染色法について正しいのはどれか。",
    "choices": [
      "加熱処理を行う。",
      "発色反応操作を行う。",
      "偏光顕微鏡で観察する。",
      "内因性ペルオキシダーゼをブロックする。",
      "フルオレセインイソチオシアネート*FITC-標識抗体を使用する。"
    ]
  },
  {
    "number": 48,
    "text": "電子顕微鏡標本作製で透過型と走査型に共通するのはどれか。",
    "choices": [
      "二重固定",
      "樹脂包埋",
      "超薄切",
      "酢酸ウラン染色",
      "金属イオン蒸着"
    ]
  },
  {
    "number": 49,
    "text": "後腹膜臓器はどれか。2つ選べ。",
    "choices": [
      "胃",
      "肝 臓",
      "膵 臓",
      "腎 臓",
      "子宮体部"
    ]
  },
  {
    "number": 50,
    "text": "ヒトの生殖細胞の分裂について誤っているのはどれか。",
    "choices": [
      "精子・卵子を作るために2回の分裂が必要である。",
      "第一分裂の開始時にDNAを複製する。",
      "第一分裂では染色体の一部に組換えが生じる。",
      "4個の卵母細胞から6個の卵子が生じる。",
      "生じた精子・卵子は23本の染色体を含む。"
    ]
  },
  {
    "number": 51,
    "text": "アポトーシスについて正しいのはどれか。2つ選べ。",
    "choices": [
      "細胞膜の破裂を伴う。",
      "ATPを必要としない。",
      "クロマチンが濃縮する。",
      "高度の炎症を惹起する。",
      "DNAはヌクレオソーム単位で切断される。"
    ]
  },
  {
    "number": 52,
    "text": "病理組織学的検査で推奨される固定液はどれか。",
    "choices": [
      "10％中性ホルマリン液",
      "10％等張ホルマリン液",
      "10％中性緩衝ホルマリン液",
      "2％グルタルアルデヒド液",
      "6％パラホルムアルデヒド液"
    ]
  },
  {
    "number": 53,
    "text": "中皮に覆われている腔はどれか。2つ選べ。",
    "choices": [
      "関節腔",
      "胸 腔",
      "心膜腔",
      "肺胞腔",
      "鼻 腔"
    ]
  },
  {
    "number": 54,
    "text": "虚血性心疾患はどれか。2つ選べ。",
    "choices": [
      "狭心症",
      "心筋梗塞",
      "心内膜炎",
      "肥大型心筋症",
      "心室中隔欠損症"
    ]
  },
  {
    "number": 55,
    "text": "T細胞性リンパ腫はどれか。",
    "choices": [
      "菌状息肉腫",
      "濾胞性リンパ腫",
      "Burkittリンパ腫",
      "Hodgkinリンパ腫",
      "マントル細胞リンパ腫"
    ]
  },
  {
    "number": 56,
    "text": "膠原線維の染色に用いられる染色法はどれか。2つ選べ。",
    "choices": [
      "PAS反応",
      "azan染色",
      "Feulgen反応",
      "mucicarmine染色",
      "Masson trichrome染色"
    ]
  },
  {
    "number": 57,
    "text": "病理解剖の感染対策で誤っているのはどれか。",
    "choices": [
      "陽圧式空調",
      "エプロンの着用",
      "使用器具の滅菌",
      "入室前の手袋着用",
      "感染症の既往の確認"
    ]
  },
  {
    "number": 58,
    "text": "子宮頸部擦過細胞診検査のPapanicolaou染色標本(別冊No. 10)を別に示す。 この細胞に関連の深い病原体はどれか。",
    "choices": [
      "カンジダ",
      "ガードネレラ菌",
      "トリコモナス原虫",
      "単純ヘルペスウイルス",
      "ヒトパピローマウイルス"
    ]
  },
  {
    "number": 59,
    "text": "末”血で過分葉核好中球がみられる場合に検査すべき項目はどれか。",
    "choices": [
      "鉄",
      "鉛",
      "葉 酸",
      "フェリチン",
      "エリスロポエチン"
    ]
  },
  {
    "number": 60,
    "text": "疾患と診断に用いる細胞表面マーカーとの組合せで誤っているのはどれか。",
    "choices": [
      "多発性骨髄腫 CD38",
      "急性骨髄性白血病 CD33",
      "急性リンパ性白血病 CD10",
      "慢性リンパ性白血病 CD3",
      "成人T細胞白血病リンパ腫 CD25"
    ]
  },
  {
    "number": 61,
    "text": "クロスミキシング試験の結果(別冊No. 11)を別に示す。 考えられるのはどれか。",
    "choices": [
      "肝不全",
      "後天性血友病A",
      "ワルファリン服用",
      "von Willebrand病",
      "播種性血管内凝固*DIC-"
    ]
  },
  {
    "number": 62,
    "text": "Bリンパ球で正しいのはどれか。2つ選べ。",
    "choices": [
      "胸腺で成熟する。",
      "CD13を発現する。",
      "IL-6が機能を抑制する。",
      "抗体産生細胞に分化する。",
      "健常成人の末”血ではTリンパ球よりも少ない。"
    ]
  },
  {
    "number": 63,
    "text": "血管拡張作用をもつのはどれか。",
    "choices": [
      "セロトニン",
      "エピネフリン",
      "トロンボキサンA2",
      "プロスタサイクリン",
      "アデノシン二リン酸*ADP-"
    ]
  },
  {
    "number": 64,
    "text": "末”血のMay-Giemsa染色標本(別冊No. 1)Ａ2及びペルオキシダーゼ染色標本 0別冊No. 12Ｂ2を別に示す。 考えられるのはどれか。",
    "choices": [
      "伝染性単核球症",
      "急性骨髄性白血病",
      "成人T細胞白血病",
      "慢性リンパ性白血病",
      "原発性マクログロブリン血症"
    ]
  },
  {
    "number": 65,
    "text": "健常者の末”血のニューメチレンブルー染色標本(別冊No. 13)を別に示す。 矢印が示す細胞について正しいのはどれか。",
    "choices": [
      "赤血球造血の指標となる。",
      "鉄欠乏性貧血で増加する。",
      "採血後放置すると増加する。",
      "青色の物質はヘモグロビンの変性物である。",
      "健常者の末”血中に3,000〜10,000/μL存在する。"
    ]
  },
  {
    "number": 66,
    "text": "活性化プロテインCが失活させるのはどれか。2つ選べ。",
    "choices": [
      "第Ⅴ因子",
      "第Ⅶ因子",
      "第Ⅷ因子",
      "第Ⅸ因子",
      "第Ⅹ因子"
    ]
  },
  {
    "number": 67,
    "text": "55歳の男性。リンパ節腫大と肝腫大のほか、高カルシウム血症と血清LD高値 を認める。末”血のMay-Giemsa染色標本(別冊No. 14)を別に示す。 この疾患に関係があるのはどれか。",
    "choices": [
      "BCR-ABL1",
      "PML-RARA",
      "EBウイルス",
      "HTLV-1ウイルス",
      "Reed-Sternberg細胞"
    ]
  },
  {
    "number": 68,
    "text": "鞭毛を有するのはどれか。",
    "choices": [
      "Acinetobacter baumannii",
      "Clostridium perfringens",
      "Klebsiella pneumoniae",
      "Shigella sonnei",
      "Vibrio parahaemolyticus"
    ]
  },
  {
    "number": 69,
    "text": "染色法と染色液の組合せで正しいのはどれか。",
    "choices": [
      "Hiss法 マラカイト緑液",
      "Wirtz法 石炭酸フクシン液",
      "Gram染色 パイフェル液",
      "Giménez染色 ゲンチアナ紫液",
      "Ziehl-Neelsen染色 サフラニン液"
    ]
  },
  {
    "number": 70,
    "text": "β-ラクタム系抗菌薬でないのはどれか。",
    "choices": [
      "メロペネム",
      "セファゾリン",
      "ピペラシリン",
      "セフォタキシム",
      "レボフロキサシン"
    ]
  },
  {
    "number": 71,
    "text": "感染経路が空気感染である病原体はどれか。2つ選べ。",
    "choices": [
      "Measles virus*麻疹ウイルス-",
      "Mycobacterium tuberculosis",
      "Mycoplasma pneumoniae",
      "Neisseria meningitidis",
      "Rubella virus*風疹ウイルス-"
    ]
  },
  {
    "number": 72,
    "text": "微生物の分類について正しいのはどれか。2つ選べ。",
    "choices": [
      "原虫は真核生物である。",
      "細菌は真核生物である。",
      "真菌は原核生物である。",
      "リケッチアは真核生物である。",
      "ウイルスは原核生物、真核生物のどちらにも分類されない。"
    ]
  },
  {
    "number": 73,
    "text": "新生児髄膜炎が疑われた患児の髄液のGram染色標本(別冊No. 15)を別に示す。 最も考えられる菌種はどれか。",
    "choices": [
      "Escherichia coli",
      "Listeria monocytogenes",
      "Neisseria gonorrhoeae",
      "Pseudomonas aeruginosa",
      "Streptococcus agalactiae"
    ]
  },
  {
    "number": 74,
    "text": "喀痰のGram染色標本(別冊No. 16)を別に示す。顕微鏡による観察で、図中の細 胞Aを48個/100倍4視野、細胞Bを5個/100倍4視野認めた。 該当するGeckler分類はどれか。",
    "choices": [
      "Geckler4群",
      "Geckler2群",
      "Geckler8群",
      "Geckler6群",
      "Geckler5群"
    ]
  },
  {
    "number": 75,
    "text": "Bacteroides fragilisについて正しいのはどれか。",
    "choices": [
      "黒色色素を産生する。",
      "インドール陽性である。",
      "カタラーゼ陰性である。",
      "エスクリンを加水分解する。",
      "アミノグリコシド系抗菌薬に感性を示す。"
    ]
  },
  {
    "number": 76,
    "text": "選択分離培地と目的菌の組合せで正しいのはどれか。",
    "choices": [
      "CIN寒天培地 Yersinia属",
      "DHL寒天培地 Campylobacter属",
      "NAC寒天培地 Shigella属",
      "Skirrow寒天培地 Legionella属",
      "WYOα寒天培地 Pseudomonas属"
    ]
  },
  {
    "number": 77,
    "text": "腸管感染を起こすのはどれか。2つ選べ。",
    "choices": [
      "ウエストナイルウイルス",
      "エンテロウイルス",
      "デングウイルス",
      "ノロウイルス",
      "EBウイルス"
    ]
  },
  {
    "number": 78,
    "text": "IPA反応陽性を示すのはどれか。",
    "choices": [
      "Citrobacter freundii",
      "Escherichia coli",
      "Klebsiella oxytoca",
      "Morganella morganii",
      "Serratia marcescens"
    ]
  },
  {
    "number": 79,
    "text": "IgEについて正しいのはどれか。",
    "choices": [
      "J鎖を持つ。",
      "補体を活性化する。",
      "2つのサブクラスがある。",
      "分子量は約900,000である。",
      "H鎖の定常部ドメインは6個からなる。"
    ]
  },
  {
    "number": 80,
    "text": "補体のC1成分について正しいのはどれか。",
    "choices": [
      "易熱性成分である。",
      "走化性因子として働く。",
      "別経路の活性化に関与する。",
      "活性化にはMg2袷が必要である。",
      "補体成分の中で血清中の濃度が最も高い。"
    ]
  },
  {
    "number": 81,
    "text": "血清中にMタンパクが認められる疾患はどれか。",
    "choices": [
      "慢性肝炎",
      "Basedow病",
      "骨髄異形成症候群",
      "原発性マクログロブリン血症",
      "全身性エリテマトーデス*SLE-"
    ]
  },
  {
    "number": 82,
    "text": "免疫担当細胞について正しいのはどれか。",
    "choices": [
      "好塩基球は貪食能を持つ。",
      "NK細胞はIFN-γを産生する。",
      "好中球は遅延型過敏反応に関与する。",
      "Th2細胞は主に細胞性免疫に関与する。",
      "CD4陽性T細胞はMHCクラスⅡを発現する。"
    ]
  },
  {
    "number": 83,
    "text": "CRP産生に関与するサイトカインはどれか。",
    "choices": [
      "IFN-γ",
      "IL-4",
      "IL-6",
      "IL-18",
      "TGF-β"
    ]
  },
  {
    "number": 84,
    "text": "臨床的意義のある不規則抗体はどれか。",
    "choices": [
      "抗C",
      "抗Leb",
      "抗N",
      "抗P1",
      "抗Xga"
    ]
  },
  {
    "number": 85,
    "text": "交差適合試験の主試験が陽性になる可能性が高いのはどれか。",
    "choices": [
      "患者がA型、提供者がO型",
      "患者がAB型、提供者がO型",
      "患者が直接抗グロブリン試験陽性",
      "提供者が直接抗グロブリン試験陽性",
      "患者がRhD陽性、提供者がRhD陰性"
    ]
  },
  {
    "number": 86,
    "text": "カラム凝集法の反応像(別冊No. 17)を別に示す。 正しいのはどれか。",
    "choices": [
      "A型 RhD陽性",
      "O型 RhD陽性",
      "O型 RhD陰性",
      "AB型 RhD陰性",
      "AB型 RhD陽性"
    ]
  },
  {
    "number": 87,
    "text": "CH が高値を示す疾患はどれか。",
    "choices": [
      "肝硬変",
      "悪性腫瘍",
      "血管神経性浮腫",
      "全身性エリテマトーデス*SLE-",
      "膜性増殖性糸球体腎炎*MPGN-"
    ]
  },
  {
    "number": 88,
    "text": "輸血用血液製剤について誤っているのはどれか。",
    "choices": [
      "濃厚血小板は振盪しながら保存する。",
      "赤血球液の保存温度は2〜1℃である。",
      "濃厚血小板の有効期限は採血後2日間である。",
      "新鮮凍結血漿の有効期限は採血後4年間である。",
      "洗浄赤血球液の有効期限は製造後48時間である。"
    ]
  },
  {
    "number": 89,
    "text": "輸血副反応と原因の組合せで正しいのはどれか。",
    "choices": [
      "C型肝炎 輸血用血液製剤中のリンパ球",
      "血管内溶血 輸血用血液製剤の補体",
      "輸血後GVHD 不規則抗体",
      "輸血関連循環過負荷*TACO- 抗内皮細胞抗体",
      "輸血関連急性肺障害*TRALI- 抗白血球抗体"
    ]
  },
  {
    "number": 90,
    "text": "院内の医療安全を確保するための措置に含まれないのはどれか。",
    "choices": [
      "ヒヤリ・ハット事例を収集する。",
      "安全管理のための職員研修を行う。",
      "医療過誤を起こした職員を処罰する。",
      "検査実施時に患者名の確認を遵守させる。",
      "医療事故発生時に原因解明のための調査を行う。"
    ]
  },
  {
    "number": 91,
    "text": "健康増進法に基づくがん検診で対象年齢が50歳以上であるのはどれか。",
    "choices": [
      "胃がん",
      "肺がん",
      "乳がん",
      "大腸がん",
      "子宮頸がん"
    ]
  },
  {
    "number": 92,
    "text": "2019年の我が国の人口動態統計で10年前と比較して上昇しているのはどれか。",
    "choices": [
      "出生率",
      "粗死亡率",
      "自然増減率",
      "乳児死亡率",
      "年齢調整死亡率"
    ]
  },
  {
    "number": 93,
    "text": "就学時健康診断に含まれないのはどれか。",
    "choices": [
      "聴 診",
      "色覚検査",
      "知能検査",
      "歯および口腔検査",
      "胸部エックス線撮影"
    ]
  },
  {
    "number": 94,
    "text": "業務上疾病の原因で最も多いのはどれか。",
    "choices": [
      "負 傷",
      "病原体",
      "化学物質",
      "作業態様",
      "物理的因子"
    ]
  },
  {
    "number": 95,
    "text": "超音波の伝搬速度が最も速いのはどれか。",
    "choices": [
      "水",
      "肝 臓",
      "空 気",
      "脂 肪",
      "頭蓋骨"
    ]
  },
  {
    "number": 96,
    "text": "電圧利得が20倍の増幅器を8つ直列につないだ増幅器の利得(dB)はどれか。 ただし、log2暗0.3とする。",
    "choices": [
      "46",
      "66",
      "78",
      "96",
      "124"
    ]
  },
  {
    "number": 97,
    "text": "アナログ信号をデジタル信号へ変換するとき、サンプル値の最大値と最小値の間 を一定の幅で分割することを示すのはどれか。",
    "choices": [
      "正規化",
      "標準化",
      "標本化",
      "量子化",
      "コード化"
    ]
  },
  {
    "number": 98,
    "text": "医療情報システムで臨床検査項目分類コードとして用いられるのはどれか。",
    "choices": [
      "DICOM",
      "HL7",
      "ICD11",
      "JLAC",
      "PACS"
    ]
  },
  {
    "number": 99,
    "text": "波長220nmの光の分類はどれか。",
    "choices": [
      "紫外線A",
      "紫外線B",
      "紫外線C",
      "赤外線A",
      "赤外線B"
    ]
  },
  {
    "number": 100,
    "text": "200mL、20℃の水を700Wの電子レンジで4分間加熱した。 加えられたエネルギーがすべて水の加熱に使われたとき、水のおよその温度(℃) はどれか。 ただし、水の比熱は4,200J/0kg・℃2とする。",
    "choices": [
      "40",
      "50",
      "60",
      "70",
      "80"
    ]
  }
];

const questionsB = [
  {
    "number": 1,
    "text": "内部精度管理法で管理血清を用いるのはどれか。2つ選べ。",
    "choices": [
      "R/X管理法",
      "X-R管理図法",
      "項目間チェック法",
      "デルタチェック法",
      "マルチルール管理図法"
    ]
  },
  {
    "number": 2,
    "text": "標準予防策において感染性を考慮しない体液・分泌物はどれか。",
    "choices": [
      "汗",
      "尿",
      "髄 液",
      "精 液",
      "唾 液"
    ]
  },
  {
    "number": 3,
    "text": "尿沈渣の無染色標本(別冊No. 1Ａ)及びSternheimer染色標本(別冊No. 1Ｂ)を別 に示す。 矢印が示す構造物はどれか。",
    "choices": [
      "顆粒円柱",
      "脂肪円柱",
      "硝子円柱",
      "上皮円柱",
      "赤血球円柱"
    ]
  },
  {
    "number": 4,
    "text": "便潜血の免疫学的検査法で正しいのはどれか。2つ選べ。",
    "choices": [
      "便中の鉄を検出する。",
      "食事制限が必要である。",
      "化学的検査法より検出感度は低い。",
      "便の表面をこするように採取する。",
      "上部より下部の消化管出血の検査に適している。"
    ]
  },
  {
    "number": 5,
    "text": "関節液の異常所見はどれか。",
    "choices": [
      "淡黄色透明",
      "比重1.010",
      "細胞数50/μL",
      "好中球比率10％",
      "蛋白濃度3.5g/dL"
    ]
  },
  {
    "number": 5,
    "text": "1",
    "choices": []
  },
  {
    "number": 6,
    "text": "中間宿主を有するのはどれか。",
    "choices": [
      "回 虫",
      "蟯 虫",
      "鉤 虫",
      "鞭 虫",
      "糸状虫"
    ]
  },
  {
    "number": 7,
    "text": "致死率が最も高いのはどれか。",
    "choices": [
      "サルマラリア",
      "卵形マラリア",
      "熱帯熱マラリア",
      "三日熱マラリア",
      "四日熱マラリア"
    ]
  },
  {
    "number": 8,
    "text": "染色体分染法でグアニン(G)-シトシン(C)塩基対優位部が濃染するのはどれか。",
    "choices": [
      "Cバンド分染法",
      "Gバンド分染法",
      "Qバンド分染法",
      "Rバンド分染法",
      "NOR分染法"
    ]
  },
  {
    "number": 9,
    "text": "アミノ酸を結合してリボソームに運搬する働きをするのはどれか。",
    "choices": [
      "mRNA",
      "rRNA",
      "tRNA",
      "hnRNA",
      "snRNA"
    ]
  },
  {
    "number": 10,
    "text": "PCR法において核酸増幅産物の特異性を高める方法として正しいのはどれか。",
    "choices": [
      "サイクル数を増やす。",
      "プライマー濃度を下げる。",
      "アニーリング温度を下げる。",
      "マグネシウム濃度を上げる。",
      "DNAポリメラーゼ濃度を上げる。"
    ]
  },
  {
    "number": 11,
    "text": "末-神経障害を呈するのはどれか。",
    "choices": [
      "Alzheimer病",
      "Creutzfeldt-Jakob病",
      "Guillain-Barré症候群",
      "Parkinson病",
      "Wilson病"
    ]
  },
  {
    "number": 12,
    "text": "染色体検査が診断に有用なのはどれか。",
    "choices": [
      "血友病A",
      "サラセミア",
      "Gaucher病",
      "Turner症候群",
      "フェニルケトン尿症"
    ]
  },
  {
    "number": 13,
    "text": "ROC曲線の縦軸と横軸の組合せで正しいのはどれか。 縦 軸 横 軸",
    "choices": [
      "感 度 特異度",
      "特異度 感 度",
      "感 度 偽陽性率",
      "偽陽性率 感 度",
      "偽陽性率 特異度"
    ]
  },
  {
    "number": 14,
    "text": "関節リウマチの診断に用いられるのはどれか。",
    "choices": [
      "抗CCP抗体",
      "抗GAD抗体",
      "抗SS-A抗体",
      "抗サイログロブリン抗体",
      "抗アセチルコリン受容体抗体"
    ]
  },
  {
    "number": 15,
    "text": "分子標的薬投与の決定にERBB20HER22増幅の検索を行うのはどれか。",
    "choices": [
      "乳 癌",
      "卵巣癌",
      "子宮頸癌",
      "子宮体癌",
      "前立腺癌"
    ]
  },
  {
    "number": 16,
    "text": "心周期現象の圧曲線模式図(別冊No. )2を別に示す。 大動脈圧曲線はどれか。",
    "choices": [
      "①",
      "②",
      "③",
      "④",
      "⑤"
    ]
  },
  {
    "number": 17,
    "text": "四肢誘導心電図(別冊No. 3)を別に示す。 正しいのはどれか。",
    "choices": [
      "右脚ブロック",
      "房室ブロック",
      "WPW症候群",
      "ペーシングリズム",
      "不随意運動によるアーチファクト"
    ]
  },
  {
    "number": 18,
    "text": "ホルター心電図検査で正しいのはどれか。2つ選べ。",
    "choices": [
      "単極誘導が用いられる。",
      "ST変化は検出できない。",
      "記録中の行動記録は解析に必要である。",
      "NASA誘導はP波の検出に優れている。",
      "CM 誘導の波形は胸部誘導のV に類似する。"
    ]
  },
  {
    "number": 19,
    "text": "最大呼気曲線(別冊No. 4)を別に示す。 考えられるのはどれか。",
    "choices": [
      "間質性肺炎",
      "胸椎後側弯症",
      "慢性閉塞性肺疾患",
      "筋萎縮性側索硬化症",
      "睡眠時無呼吸症候群"
    ]
  },
  {
    "number": 20,
    "text": "動脈血ガス分析の所見を示す。 pH 7.36 PaO 58Torr PaCO 56Torr HCO 安 31mEq/L 誤っているのはどれか。",
    "choices": [
      "呼吸不全である。",
      "腎性代償である。",
      "アシデミアである。",
      "肺胞低換気である。",
      "呼吸性アシドーシスである。"
    ]
  },
  {
    "number": 21,
    "text": "神経線維における活動電位とその伝導について誤っているのはどれか。",
    "choices": [
      "温度が低いと伝導は遅くなる。",
      "軸索の直径が太いほど伝導は速い。",
      "活動電位の大きさは減衰せずに伝導する。",
      "中間部で発生した活動電位は両方向に伝導する。",
      "刺激の強さに比例して発生する活動電位が大きくなる。"
    ]
  },
  {
    "number": 22,
    "text": "誘発電位(別冊No. 5)を別に示す。 この記録はどれか。",
    "choices": [
      "視覚誘発電位",
      "事象関連電位",
      "聴性定常反応",
      "聴性脳幹反応",
      "体性感覚誘発電位"
    ]
  },
  {
    "number": 23,
    "text": "針筋電図検査において急性脱神経でみられるのはどれか。",
    "choices": [
      "急速動員",
      "陽性鋭波",
      "高振幅電位",
      "多相性電位",
      "ミオトニー放電"
    ]
  },
  {
    "number": 24,
    "text": "心臓超音波カラードプラ法の四腔像(別冊No. 6)を別に示す。 疾患はどれか。",
    "choices": [
      "Fallot四徴症",
      "大血管転位症",
      "動脈管開存症",
      "心室中隔欠損症",
      "心房中隔欠損症"
    ]
  },
  {
    "number": 25,
    "text": "上腹部超音波像(別冊No. 7)を別に示す。 走査法はどれか。",
    "choices": [
      "右肋間走査",
      "心窩部横走査",
      "心窩部縦走査",
      "右季肋部斜走査",
      "右肋骨弓下走査"
    ]
  },
  {
    "number": 26,
    "text": "下腹部正中横走査による女性の骨盤腔の超音波像(別冊No. 8)を別に示す。 矢印で示すのはどれか。",
    "choices": [
      "腟",
      "子 宮",
      "直 腸",
      "膀 胱",
      "卵 巣"
    ]
  },
  {
    "number": 27,
    "text": "医療用MRIについて誤っているのはどれか。",
    "choices": [
      "任意の断面を画像化できる。",
      "炭素の磁気共鳴信号を画像化する。",
      "拡散強調画像は急性期の脳梗塞検出能に優れる。",
      "頭部では造影剤を用いずに血管の撮影ができる。",
      "拡散テンソル画像は神経線維の走行を描出できる。"
    ]
  },
  {
    "number": 28,
    "text": "眼底写真(別冊No. 9)を別に示す。 矢印で示すのはどれか。",
    "choices": [
      "黄 斑",
      "白 斑",
      "水晶体",
      "中心窩",
      "視神経乳頭"
    ]
  },
  {
    "number": 29,
    "text": "水溶性ビタミンはどれか。2つ選べ。",
    "choices": [
      "ビタミンA",
      "ビタミンC",
      "ビタミンE",
      "ビタミンK",
      "葉 酸"
    ]
  },
  {
    "number": 30,
    "text": "尿を検体として測定するのはどれか。",
    "choices": [
      "オステオカルシン19OC20",
      "骨型アルカリホスファターゼ19BAP20",
      "Ⅰ型コラーゲン架橋Cテロペプチド19CTX20",
      "Ⅰ型プロコラーゲンCプロペプチド19PICP20",
      "Ⅰ型プロコラーゲンNプロペプチド19PINP20"
    ]
  },
  {
    "number": 31,
    "text": "過酸化水素・ペルオキシダーゼ系呈色反応に必要な試薬はどれか。2つ選べ。",
    "choices": [
      "ADP",
      "NAD(P)H",
      "フェノール",
      "4-ニトロフェノール",
      "4-アミノアンチピリン"
    ]
  },
  {
    "number": 32,
    "text": "放射線に関する物理量と単位の組合せで正しいのはどれか。",
    "choices": [
      "放射能 eV",
      "吸収線量 C・kg-1",
      "照射線量 Gy",
      "線量当量 Sv",
      "放射線のエネルギー Bq"
    ]
  },
  {
    "number": 33,
    "text": "直接ビリルビンが高値を示すのはどれか。",
    "choices": [
      "新生児黄疸",
      "溶血性貧血",
      "Gilbert症候群",
      "Crigler-Najjar症候群",
      "Dubin-Johnson症候群"
    ]
  },
  {
    "number": 34,
    "text": "CK-MBが著しく上昇する疾患はどれか。",
    "choices": [
      "心筋炎",
      "皮膚筋炎",
      "重症筋無力症",
      "筋萎縮性側索硬化症",
      "Duchenne型筋ジストロフィー"
    ]
  },
  {
    "number": 35,
    "text": "アミラーゼについて誤っているのはどれか。",
    "choices": [
      "α1,4-グリコシド結合を分解する。",
      "活性化にはクロールイオンが必要である。",
      "カルシウムイオンを含有する酵素である。",
      "膵臓型は唾液腺型よりも分子量が大きい。",
      "日本臨床化学会19JSCC20勧告法では共役酵素を用いる。"
    ]
  },
  {
    "number": 36,
    "text": "eGFRの計算に使用するのはどれか。2つ選べ。",
    "choices": [
      "身 長",
      "体 重",
      "年 齢",
      "血清クレアチニン濃度",
      "尿中クレアチニン濃度"
    ]
  },
  {
    "number": 37,
    "text": "レシチンコレステロールアシルトランスフェラーゼ19LCAT20を活性化するのはど れか。",
    "choices": [
      "アポA1",
      "アポA2",
      "アポB100",
      "アポC3",
      "アポE"
    ]
  },
  {
    "number": 38,
    "text": "ビウレット法でキレート呈色反応を示すのはどれか。",
    "choices": [
      "鉄イオン",
      "銅イオン",
      "亜鉛イオン",
      "カルシウムイオン",
      "マグネシウムイオン"
    ]
  },
  {
    "number": 39,
    "text": "血中半減期が最も短いのはどれか。",
    "choices": [
      "ALT",
      "AMY",
      "AST",
      "CK",
      "LD5"
    ]
  },
  {
    "number": 40,
    "text": "血中薬物濃度モニタリングの対象にならないのはどれか。",
    "choices": [
      "ジゴキシン",
      "バルプロ酸",
      "テオフィリン",
      "ワルファリン",
      "バンコマイシン"
    ]
  },
  {
    "number": 41,
    "text": "インスリンの分泌を抑制するのはどれか。",
    "choices": [
      "アミノ酸",
      "グルカゴン",
      "グルコース",
      "インクレチン",
      "ソマトスタチン"
    ]
  },
  {
    "number": 42,
    "text": "酸化還元酵素はどれか。",
    "choices": [
      "CK",
      "LD",
      "ALT",
      "AST",
      "γ-GT"
    ]
  },
  {
    "number": 43,
    "text": "Lambert-Beerの法則が成り立つ条件で、15μmolの物質AをX mLのイオン交 換水に溶解し、光路長10mmのセルで吸光度を測定したところ0.945であった。 Aのモル吸光度係数を6.3庵103L・mol-1・cm-1とするとXはどれか。",
    "choices": [
      "2",
      "10",
      "50",
      "100",
      "200"
    ]
  },
  {
    "number": 44,
    "text": "炭化水素鎖中に4つの二重結合を持つ脂肪酸はどれか。",
    "choices": [
      "オレイン酸",
      "リノール酸",
      "ステアリン酸",
      "パルミチン酸",
      "α-リノレン酸"
    ]
  },
  {
    "number": 45,
    "text": "マイヤー19Mayer20とカラッチ19Carazzi20のヘマトキシリン液のどちらにも用いら れるのはどれか。",
    "choices": [
      "クエン酸",
      "過ヨウ素酸",
      "グリセリン",
      "抱水クロラール",
      "カリウムミョウバン"
    ]
  },
  {
    "number": 46,
    "text": "疾患とその診断に有用な染色法との組合せで誤っているのはどれか。",
    "choices": [
      "肝硬変 渡辺の鍍銀法",
      "心筋梗塞 azan染色",
      "ヘモジデローシス toluidine blue染色",
      "慢性糸球体腎炎 PAM染色",
      "B型肝炎 Victoria blue染色"
    ]
  },
  {
    "number": 47,
    "text": "細胞診標本上でみられる小細胞癌の形態学的特徴はどれか。",
    "choices": [
      "核偏在性",
      "真珠形成",
      "粘液空胞",
      "鋳型状配列",
      "オタマジャクシ型"
    ]
  },
  {
    "number": 48,
    "text": "H-E染色標本(別冊No. 10)を別に示す。 この臓器はどれか。",
    "choices": [
      "視床下部",
      "下垂体",
      "副甲状腺",
      "膵 臓",
      "副 腎"
    ]
  },
  {
    "number": 49,
    "text": "健常成人で肝臓に接していないのはどれか。",
    "choices": [
      "横隔膜",
      "腎 臓",
      "胆 囊",
      "脾 臓",
      "副 腎"
    ]
  },
  {
    "number": 50,
    "text": "病理解剖において切開開始前の手順に含まれないのはどれか。",
    "choices": [
      "身長の計測",
      "皮膚の清拭",
      "死後硬直の確認",
      "臨床経過の確認",
      "病理解剖承諾書の確認"
    ]
  },
  {
    "number": 51,
    "text": "癌抑制遺伝子はどれか。",
    "choices": [
      "BRAF",
      "BRCA1",
      "ERBB20HER22",
      "KIT",
      "KRAS"
    ]
  },
  {
    "number": 52,
    "text": "乳腺で癌が発生しやすい部位はどれか。",
    "choices": [
      "内側上部",
      "内側下部",
      "外側上部",
      "外側下部",
      "乳頭部"
    ]
  },
  {
    "number": 53,
    "text": "電子顕微鏡標本作製時の工程と用いる試薬との組合せで正しいのはどれか。",
    "choices": [
      "前固定 オスミウム酸液",
      "後固定 グルタルアルデヒド液",
      "脱 水 エタノール",
      "置 換 キシレン",
      "包 埋 カーボワックス"
    ]
  },
  {
    "number": 54,
    "text": "外胚葉から発生するのはどれか。2つ選べ。",
    "choices": [
      "気 管",
      "結 腸",
      "脾 臓",
      "中枢神経",
      "副腎髄質"
    ]
  },
  {
    "number": 55,
    "text": "細胞診検体のGiemsa染色で正しいのはどれか。",
    "choices": [
      "核が異染性を示す。",
      "細胞質の角化が明瞭となる。",
      "細胞質内顆粒が観察しやすい。",
      "乾燥により細胞が小さく見える。",
      "クロマチン構造が観察しやすい。"
    ]
  },
  {
    "number": 56,
    "text": "パラフィン包埋に用いられる硬パラフィンの融点に最も近いのはどれか。",
    "choices": [
      "38℃",
      "48℃",
      "58℃",
      "68℃",
      "78℃"
    ]
  },
  {
    "number": 57,
    "text": "病理解剖時に摘出された臓器の肉眼写真(別冊No. 11)を別に示す。 臓器はどれか。",
    "choices": [
      "心 臓",
      "膵 臓",
      "肝 臓",
      "脾 臓",
      "腎 臓"
    ]
  },
  {
    "number": 58,
    "text": "ミトコンドリアが存在しないのはどれか。",
    "choices": [
      "好中球",
      "赤血球",
      "形質細胞",
      "リンパ球",
      "マクロファージ"
    ]
  },
  {
    "number": 59,
    "text": "細胞形態の特徴と疾患の組合せで誤っているのはどれか。",
    "choices": [
      "異型リンパ球 伝染性単核球症",
      "環状鉄芽球 サラセミア",
      "巨大血小板 May-Hegglin異常症",
      "中毒性顆粒 重症感染症",
      "微小巨核球 骨髄異形成症候群"
    ]
  },
  {
    "number": 60,
    "text": "血栓性血小板減少性紫斑病で認められるのはどれか。2つ選べ。",
    "choices": [
      "網赤血球減少",
      "ハプトグロビン高値",
      "ADAMTS13活性低下",
      "超高分子量VWFマルチマー出現",
      "ループスアンチコアグラント陽性"
    ]
  },
  {
    "number": 61,
    "text": "鉄欠乏性貧血および慢性炎症に伴う貧血で共通するのはどれか。2つ選べ。",
    "choices": [
      "小球性貧血である。",
      "血清鉄が低値である。",
      "鉄の利用障害を認める。",
      "血清フェリチンが低値である。",
      "総鉄結合能19TIBC20が高値である。"
    ]
  },
  {
    "number": 62,
    "text": "細胞浮遊液の細胞数を算定した。Bürker-Türk計算盤(別冊No. 1)2を別に示す。 図中に赤字で示す数字は、赤点線で囲った各大区画にある細胞数である。検体は、 希釈せず使用し、大区画の容積は0.1μLとする。 細胞浮遊液の細胞数»/μL…はどれか。",
    "choices": [
      "9",
      "36",
      "90",
      "360",
      "900"
    ]
  },
  {
    "number": 63,
    "text": "肝臓で合成されないのはどれか。",
    "choices": [
      "Dダイマー",
      "フィブリノゲン",
      "プラスミノゲン",
      "アンチトロンビン",
      "プラスミンインヒビター"
    ]
  },
  {
    "number": 64,
    "text": "末-血のMay-Giemsa染色標本(別冊No. 13)を別に示す。 認められるのはどれか。",
    "choices": [
      "鎌状赤血球",
      "菲薄赤血球",
      "標的赤血球",
      "有核赤血球",
      "涙滴赤血球"
    ]
  },
  {
    "number": 65,
    "text": "リン脂質依存性凝固反応に関与するのはどれか。",
    "choices": [
      "第Ⅷ因子",
      "第Ⅺ因子",
      "第Ⅻ因子",
      "フィブリノゲン",
      "プレカリクレイン"
    ]
  },
  {
    "number": 66,
    "text": "骨髄25刺液のMay-Giemsa染色標本(別冊No. 14)を別に示す。 矢印の細胞が腫瘍化した疾患はどれか。",
    "choices": [
      "赤白血病",
      "多発性骨髄腫",
      "Burkittリンパ腫",
      "急性骨髄性白血病",
      "急性リンパ性白血病"
    ]
  },
  {
    "number": 67,
    "text": "骨髄細胞の染色体核型(別冊No. 15)を別に示す。 矢印の染色体異常に関与するのはどれか。",
    "choices": [
      "BCR-ABL1",
      "IGH/BCL2",
      "IGH/BCL6",
      "IGH/MYC",
      "PML-RARA"
    ]
  },
  {
    "number": 68,
    "text": "髄液のGram染色標本(別冊No. 16)を別に示す。分離菌はヒツジ血液寒天培地に 発育し、グルコース及びマルトースを分解した。 推定されるのはどれか。",
    "choices": [
      "Haemophilus influenzae",
      "Moraxella catarrhalis",
      "Neisseria meningitidis",
      "Neisseria gonorrhoeae",
      "Pseudomonas aeruginosa"
    ]
  },
  {
    "number": 69,
    "text": "エンベロープを持つのはどれか。",
    "choices": [
      "ノロウイルス",
      "ロタウイルス",
      "アデノウイルス",
      "ポリオウイルス",
      "インフルエンザウイルス"
    ]
  },
  {
    "number": 70,
    "text": "微生物検査結果について緊急報告が必要でないのはどれか。",
    "choices": [
      "静脈血からEscherichia coliが検出された場合",
      "髄液からCryptococcus neoformansが検出された場合",
      "皮膚からStaphylococcus epidermidisが検出された場合",
      "喀痰からMycobacterium tuberculosisが検出された場合",
      "胸水からカルバペネム耐性腸内細菌科細菌が検出された場合"
    ]
  },
  {
    "number": 71,
    "text": "喀痰のGram染色で染まりにくいのはどれか。",
    "choices": [
      "Haemophilus influenzae",
      "Klebsiella pneumoniae",
      "Legionella pneumophila",
      "Moraxella catarrhalis",
      "Streptococcus pneumoniae"
    ]
  },
  {
    "number": 72,
    "text": "5％炭酸ガス培養下のヒツジ血液寒天培地に発育するのはどれか。2つ選べ。",
    "choices": [
      "Fusobacterium nucleatum",
      "Haemophilus influenzae",
      "Legionella pneumophila",
      "Moraxella catarrhalis",
      "Streptococcus pneumoniae"
    ]
  },
  {
    "number": 73,
    "text": "血液培養の採血時に皮膚の消毒に用いるのはどれか。2つ選べ。",
    "choices": [
      "過酢酸",
      "フタラール",
      "ポビドンヨード",
      "次亜塩素酸ナトリウム",
      "グルコン酸クロルヘキシジンアルコール"
    ]
  },
  {
    "number": 74,
    "text": "多剤耐性緑膿菌19MDRP20の判定に使用される抗菌薬はどれか。",
    "choices": [
      "イミペネム",
      "オキサシリン",
      "セフォキシチン",
      "テイコプラニン",
      "バンコマイシン"
    ]
  },
  {
    "number": 75,
    "text": "偏性細胞内寄生性を有するのはどれか。",
    "choices": [
      "Cryptococcus neoformans",
      "Listeria monocytogenes",
      "Mycobacterium tuberculosis",
      "Mycoplasma pneumoniae",
      "Rickettsia prowazekii"
    ]
  },
  {
    "number": 76,
    "text": "スライド培養の顕微鏡写真(別冊No. 17)を別に示す。大分生子を矢印で示す。 考えられるのはどれか。",
    "choices": [
      "Aspergillus fumigatus",
      "Epidermophyton floccosum",
      "Microsporum canis",
      "Sporothrix schenckii",
      "Trichophyton rubrum"
    ]
  },
  {
    "number": 77,
    "text": "TSI培地に腸内細菌科細菌を接種して4日後の写真(別冊No. 18)を別に示す。 判定として誤っているのはどれか。",
    "choices": [
      "白糖分解",
      "乳糖非分解",
      "ブドウ糖発酵",
      "硫化水素産生",
      "ブドウ糖からのガス産生"
    ]
  },
  {
    "number": 78,
    "text": "Listeria monocytogenesについて誤っているのはどれか。",
    "choices": [
      "Gram陽性短桿菌である。",
      "CAMPテスト陽性である。",
      "馬尿酸塩加水分解試験陽性である。",
      "エスクリン加水分解試験陽性である。",
      "ヒツジ血液寒天培地でα溶血性を示す。"
    ]
  },
  {
    "number": 79,
    "text": "この所見の染色パターンはどれか。",
    "choices": [
      "斑紋型",
      "辺縁型",
      "核小体型",
      "細胞質型",
      "散在斑紋型"
    ]
  },
  {
    "number": 80,
    "text": "この所見を示す自己抗体はどれか。",
    "choices": [
      "抗DNA抗体",
      "抗核小体抗体",
      "抗ヒストン抗体",
      "抗ミトコンドリア抗体",
      "抗ENA19可溶性核抗原20抗体"
    ]
  },
  {
    "number": 81,
    "text": "検査まで検体を全血のまま冷蔵保存してもよいのはどれか。",
    "choices": [
      "抗核抗体",
      "寒冷凝集素測定",
      "クリオグロブリン",
      "直接抗グロブリン試験",
      "Donath-Landsteiner試験"
    ]
  },
  {
    "number": 82,
    "text": "抗原抗体反応に関与しないのはどれか。",
    "choices": [
      "共有結合",
      "水素結合",
      "疎水結合",
      "イオン結合",
      "ファンデルワールス力"
    ]
  },
  {
    "number": 83,
    "text": "乳癌の腫瘍マーカーはどれか。",
    "choices": [
      "CA15-3",
      "CA19-9",
      "CYFRA21-1",
      "NSE",
      "SCC"
    ]
  },
  {
    "number": 84,
    "text": "直接抗グロブリン試験について正しいのはどれか。",
    "choices": [
      "患者の血清を使用する。",
      "反応増強剤にPEGが使用される。",
      "交差適合試験の主試験に必要である。",
      "不規則抗体スクリーニングに必要である。",
      "溶血性輸血副反応が生じた際に必要である。"
    ]
  },
  {
    "number": 85,
    "text": "血液型検査の結果を以下に示す。 抗A 抗B A 赤血球 B赤血球 抗D Rhコントロール : : 6袷 6袷 : : 血液型を確定するために必要な検査はどれか。",
    "choices": [
      "吸着解離試験",
      "抗体同定試験",
      "糖転移酵素測定",
      "D陰性確認試験",
      "直接抗グロブリン試験"
    ]
  },
  {
    "number": 86,
    "text": "胎児・新生児溶血性疾患の原因となる不規則抗体はどれか。2つ選べ。",
    "choices": [
      "抗Bga",
      "抗c",
      "抗E",
      "抗Lea",
      "抗N"
    ]
  },
  {
    "number": 87,
    "text": "貯血式自己血輸血について正しいのはどれか。2つ選べ。",
    "choices": [
      "手術前日に貯血する。",
      "待機手術患者が適応となる。",
      "80歳以上の高齢者は禁忌である。",
      "体重50kg未満の患者は禁忌である。",
      "肝炎ウイルス感染症のリスクを回避できる。"
    ]
  },
  {
    "number": 88,
    "text": "A型患者の骨髄移植で、ドナー血液型と移植後4週間の輸血用血液製剤の血液 型との組合せで正しいのはどれか。",
    "choices": [
      "ドナーO型 赤血球輸血はA型",
      "ドナーO型 血小板輸血はO型",
      "ドナーB型 新鮮凍結血漿輸血はO型",
      "ドナーB型 赤血球輸血はAB型",
      "ドナーB型 新鮮凍結血漿輸血はAB型"
    ]
  },
  {
    "number": 89,
    "text": "オモテ検査でB型、ウラ検査でO型と判定された。 原因となるのはどれか。2つ選べ。",
    "choices": [
      "後天性B",
      "寒冷凝集素",
      "不規則抗体",
      "無ガンマグロブリン血症",
      "直接抗グロブリン試験陽性"
    ]
  },
  {
    "number": 90,
    "text": "2019年の我が国の簡易生命表で:歳男性と:歳女性の平均余命の差に最も近い のはどれか。",
    "choices": [
      "4年",
      "8年",
      ";年",
      "<年",
      "12年"
    ]
  },
  {
    "number": 91,
    "text": "要因Aは疾患Bのリスクファクターであると判定するために不可欠なのはどれ か。",
    "choices": [
      "疾患Bの患者は要因Aを持つ。",
      "要因Aが疾患Bの発症に先行する。",
      "要因Aが存在しないと疾患Bを発症しない。",
      "要因Aと疾患Bの間に量安反応関係が成り立つ。",
      "要因Aに曝露されると疾患Bを発症することを動物実験で再現できる。"
    ]
  },
  {
    "number": 92,
    "text": "ヘルスプロモーションに含まれないのはどれか。",
    "choices": [
      "公共の場での禁煙の推進",
      "家庭で使える医療機器の開発",
      "地域住民への健康教育の実施",
      "ウォーキングが行える歩道の整備",
      "救急医療機関への搬送体制の整備"
    ]
  },
  {
    "number": 93,
    "text": "がん対策基本法の基本的施策に含まれないのはどれか。",
    "choices": [
      "がん登録の推進",
      "がん検診の受診率の向上",
      "がんに関する研究の推進",
      "がん治療にかかる医療費の適正化",
      "専門的な知識・技術を有する医療従事者の育成"
    ]
  },
  {
    "number": 94,
    "text": "公衆衛生の事業とそれを規定する法律との組合せで正しいのはどれか。",
    "choices": [
      "労働者の健康診断の実施 労働基準法",
      "市町村保健センターの設置 健康増進法",
      "自動車排出ガスの排出規制 環境基本法",
      "医療安全支援センターの設置 医療法",
      "公共の場所での受動喫煙の防止 地域保健法"
    ]
  },
  {
    "number": 95,
    "text": "2byteで表せる状態の数はどれか。",
    "choices": [
      "16通り",
      "256通り",
      "1,024通り",
      "16,384通り",
      "65,536通り"
    ]
  },
  {
    "number": 96,
    "text": "臨床検査情報の一次利用はどれか。",
    "choices": [
      "保健所への報告",
      "医学研究への利用",
      "教育用資料の作成",
      "疾患の診断への利用",
      "データベースへの利用"
    ]
  },
  {
    "number": 97,
    "text": "滅菌について正しいのはどれか。2つ選べ。",
    "choices": [
      "γ線は包装後の滅菌に有効である。",
      "濾過滅菌は血清の滅菌に適さない。",
      "乾熱滅菌はエンドトキシンを無毒化する。",
      "高圧蒸気滅菌は芽胞を有する細菌に無効である。",
      "過酸化水素プラズマ滅菌はカテーテルの滅菌に無効である。"
    ]
  },
  {
    "number": 98,
    "text": "トランスデューサでないのはどれか。",
    "choices": [
      "圧電素子",
      "OPアンプ",
      "サーミスタ",
      "ストレンゲージ",
      "ポテンショメータ"
    ]
  },
  {
    "number": 99,
    "text": "カラーRGB各4byteの階調、1,000庵1,000画素、60フレーム/秒、15秒の動 画がある。 データを圧縮しない場合、動画ファイルのおよそのサイズbbytecはどれか。",
    "choices": [
      "2.7庵106",
      "9庵106",
      "2.7庵109",
      "9庵109",
      "9庵1012"
    ]
  },
  {
    "number": 100,
    "text": "光学顕微鏡について正しいのはどれか。",
    "choices": [
      "開口数が大きいほど分解能が低下する。",
      "尿沈渣の観察はコンデンサを上げて行う。",
      "像の明るさは対物レンズの開口数の2乗に比例する。",
      "総合倍率は接眼レンズと対物レンズの倍率の和で表される。",
      "実視野は接眼レンズの視野数と対物レンズの倍率の積で表される。"
    ]
  }
];

const answers = {
  "A001": 3,
  "A002": 15,
  "A003": 4,
  "A004": 5,
  "A005": 4,
  "A006": 5,
  "A007": 4,
  "A008": 3,
  "A009": 5,
  "A010": 5,
  "A011": 5,
  "A012": 3,
  "A013": 1,
  "A014": 1,
  "A015": 2,
  "A016": 1,
  "A017": 2,
  "A018": 3,
  "A019": 13,
  "A020": 45,
  "A021": 5,
  "A022": 2,
  "A023": 1,
  "A024": 2,
  "A025": 5,
  "A026": 3,
  "A027": 3,
  "A028": 4,
  "A029": 24,
  "A030": 4,
  "A031": 25,
  "A032": 5,
  "A033": 5,
  "A034": 14,
  "A035": 3,
  "A036": 3,
  "A037": 3,
  "A038": 1,
  "A039": 24,
  "A040": 3,
  "A041": 4,
  "A042": 5,
  "A043": 4,
  "A044": 4,
  "A045": 5,
  "A046": 1,
  "A047": 5,
  "A048": 1,
  "A049": 34,
  "A050": 2,
  "A051": 35,
  "A052": 3,
  "A053": 23,
  "A054": 12,
  "A055": 1,
  "A056": 25,
  "A057": 1,
  "A058": 5,
  "A059": 3,
  "A060": 4,
  "A061": 2,
  "A062": 45,
  "A063": 4,
  "A064": 2,
  "A065": 1,
  "A066": 13,
  "A067": 4,
  "A068": 5,
  "A069": 3,
  "A070": 5,
  "A071": 12,
  "A072": 15,
  "A073": 1,
  "A074": 1,
  "A075": 4,
  "A076": 1,
  "A077": 24,
  "A078": 4,
  "A079": 5,
  "A080": 1,
  "A081": 4,
  "A082": 2,
  "A083": 3,
  "A084": 1,
  "A085": 4,
  "A086": 5,
  "A087": 2,
  "A088": 3,
  "A089": 5,
  "A090": 3,
  "A091": 1,
  "A092": 2,
  "A093": 2,
  "A094": 1,
  "A095": 5,
  "A096": 3,
  "A097": 4,
  "A098": 4,
  "A099": 3,
  "A100": 4,
  "B001": 25,
  "B002": 1,
  "B003": 1,
  "B004": 45,
  "B005": 5,
  "B006": 5,
  "B007": 3,
  "B008": 4,
  "B009": 3,
  "B010": 2,
  "B011": 3,
  "B012": 4,
  "B013": 3,
  "B014": 1,
  "B015": 1,
  "B016": 1,
  "B017": 4,
  "B018": 34,
  "B019": 3,
  "B020": 3,
  "B021": 5,
  "B022": 4,
  "B023": 2,
  "B024": 5,
  "B025": 2,
  "B026": 2,
  "B027": 2,
  "B028": 5,
  "B029": 25,
  "B030": 3,
  "B031": 35,
  "B032": 4,
  "B033": 5,
  "B034": 1,
  "B035": 4,
  "B036": 34,
  "B037": 1,
  "B038": 2,
  "B039": 2,
  "B040": 4,
  "B041": 5,
  "B042": 2,
  "B043": 4,
  "B044": 1,
  "B045": 5,
  "B046": 3,
  "B047": 4,
  "B048": 5,
  "B049": 4,
  "B050": 2,
  "B051": 2,
  "B052": 3,
  "B053": 3,
  "B054": 45,
  "B055": 3,
  "B056": 3,
  "B057": 4,
  "B058": 2,
  "B059": 2,
  "B060": 34,
  "B061": 12,
  "B062": 3,
  "B063": 1,
  "B064": 5,
  "B065": 1,
  "B066": 2,
  "B067": 5,
  "B068": 3,
  "B069": 5,
  "B070": 3,
  "B071": 3,
  "B072": 45,
  "B073": 35,
  "B074": 1,
  "B075": 5,
  "B076": 5,
  "B077": 1,
  "B078": 5,
  "B079": 2,
  "B080": 1,
  "B081": 1,
  "B082": 1,
  "B083": 1,
  "B084": 5,
  "B085": 4,
  "B086": 23,
  "B087": 25,
  "B088": 5,
  "B089": 23,
  "B090": 3,
  "B091": 2,
  "B092": 5,
  "B093": 4,
  "B094": 4,
  "B095": 5,
  "B096": 4,
  "B097": 13,
  "B098": 2,
  "B099": 3,
  "B100": 3
};

let prefix;
let questionNumber;

function loadQuestion() {
  let questionSet = prefix === "A" ? questionsA : questionsB;
  questionNumber = Math.floor(Math.random() * questionSet.length);
  let question = questionSet[questionNumber];

  document.getElementById("question-text").innerText = question.text;
  let choices = document.getElementById("choices");
  choices.innerHTML = "";

  question.choices.forEach((choice, index) => {
    let choiceElem = document.createElement("button");
    choiceElem.classList.add("choice");
    choiceElem.innerText = choice;
    choiceElem.onclick = () => {
      checkAnswer(index);
    };
    choices.appendChild(choiceElem);
  });
}

function checkAnswer(selectedIndex) {
  let answerIndex = answers[`${prefix}${questionNumber + 1}`] - 1;
  let result = selectedIndex === answerIndex ? "正解！" : "不正解";
  alert(result);
}

function initQuiz() {
  let hash = window.location.hash.substring(1);
  if (hash === "A" || hash === "B") {
    prefix = hash;
    loadQuestion();
  } else {
    window.location.href = "index.html";
  }
}

window.onload = initQuiz;
